<template>
  <div id="sign_up">
    <form class="input-fiel">
      <div class="fiel-row">
        <div class="fiel-item area_code inline" @click="toggleAreaSelector">
          <div class="code">+{{ areaCode.code }}</div>
          <md-icon name="arrow-down" />
        </div>
        <div class="fiel-item fill">
          <input
            type="tel"
            v-model="signUp.phone"
            placeholder="请输入手机号"
            :maxlength="11"
          />
        </div>
      </div>
      <div class="fiel-row">
        <div class="fiel-item fill">
          <input
            type="text"
            v-model="signUp.code"
            placeholder="请输入6位数验证码"
            :maxlength="6"
          />
          <md-button
            type="primary"
            round
            size="small"
            class="button"
            :loging="sendCode.status"
            @click="login"
            >发送验证码</md-button
          >
        </div>
      </div>
      <div class="fiel-row">
        <div class="fiel-item fill">
          <input
            :type="passwordStatus ? 'text' : 'password'"
            v-model="signUp.password"
            placeholder="请输入6-18位的新密码，不含空格"
          />
          <svg
            class="icon"
            aria-hidden="true"
            @click="passwordStatus = !passwordStatus"
          >
            <use
              :xlink:href="passwordStatus ? '#icon-eye' : '#icon-eye-slash'"
            />
          </svg>
        </div>
      </div>
      <div class="fiel-row">
        <div class="fiel-item fill">
          <input
            type="text"
            v-model="signUp.invite"
            placeholder="输入邀请码(非必填)"
          />
        </div>
      </div>
      <div class="fiel-row between center">
        <p>
          注册即代表同意
          <span class="primary" @click="protocol = !protocol"
            >《NN约玩协议》</span
          >
        </p>
        <md-button
          size="small"
          @click="authorizeWx"
          class="normal"
          type="link"
          inline
          >忘记密码？</md-button
        >
      </div>
      <div class="fiel-row">
        <md-button type="primary" round @click="gotoBasicInfo"
          >立即注册</md-button
        >
      </div>
    </form>
    <md-landscape v-model="protocol" full-screen>
      <h1>用户协议</h1>
      <p>
        欢迎申请使用【
        武汉奥拉夫网络科技有限公司】有限公司（以下简称“本公司”）提供的服务。本公司通过网络平台：网址【www.nn.com】（以下简称“NN约玩”）向用户提供服务（以下简称“本服务”）。请用户仔细阅读以下全部内容（特别是粗体下划线标注的内容）并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权使用本协议中所提供的服务。您一经注册或接受本协议中的服务即视为对本协议全部条款已充分理解并完全接受。此后，您不得以未阅读本协议条款内容作任何形式的抗辩。
      </p>
      <h2>一、服务相关定义</h2>
      <ol>
        <li>
          1、功能封禁：指本公司有权视情况对违规账号进行某项或某几项功能禁止使用。
        </li>
        <li>
          2、账号冻结：指本公司有权视情况对违规账号进行一定时间的禁止使用。被冻结期间不可账号登录、使用。
        </li>
        <li>
          3、设备封禁：指本公司有权视情况对违规账号所登录的设备进行一定时间的禁止使用。被设备封禁的登录设备在封禁期间不能登录任何账号。
        </li>
        <li>
          4、永久封号：指本公司有权视情况对违规账号进行永久禁止使用并删除账号信息，注册时已绑定的电子邮箱和手机号不得再次注册。被永久封号账号内的虚拟货币，将视为违规用户违反本协议的违约金向本公司支付。
        </li>
      </ol>
      <h2>二、账号注册</h2>
      <ol>
        <li>
          1、用户在接受本服务前需要注册一个NN约玩账号。账号应当使用手机号码绑定注册，请用户使用尚未与NN约玩账号绑定的手机号码，以及未被本公司根据本协议封禁的手机号码注册NN约玩账号。本公司可以根据用户需求或产品需求对账号注册和绑定的方式进行更改，而无须事先通知用户。
        </li>
        <li>
          2、用户注册时授权本公司公开及使用其他地理位置信息方后可成功注册NN约玩账号。故用户完成注册即表明用户同意本公司提取、公开及使用用户的地理位置信息。
        </li>
        <li>
          3、鉴于NN约玩账号的绑定注册方式，您同意本公司在注册时将自动提取您的手机号码及手机设备识别码等信息用于注册。
        </li>
        <li>
          4、在用户注册及使用本服务时，本公司需要搜集能识别用户身份的个人信息以便本公司可以在必要时联系用户或为用户提供更好的使用体验。具体请见“隐私权政策”条款。
        </li>
      </ol>
      <h2>三、服务内容</h2>
      <ol>
        <li>
          1、NN约玩服务的具体内容是指用户通过NN约玩平台实现发布和（或）获取娱乐需求信息，以及与娱乐相关的订单记录、费用结算、评价等活动。但平台不实际提供娱乐服务，不代理任何用户一方提供的娱乐服务，仅充当用户之间的中间人，用户之间使用或提供娱乐服务受其签订的协议约束，平台不是此类协议的任何一方主体。具体服务内容包括以下：
          <ol>
            <li>
              1）信息发布服务。NN约玩向用户提供的各种信息及资料仅供参考，用户应依其独立判断做出决策。用户据此进行交易的，产生的风险由用户自行承担，用户无权据此向本公司及NN约玩提出任何法律主张。在交易过程中，用户之间发生的纠纷，由纠纷各方自行解决，本公司及NN约玩不承担任何责任。
            </li>
            <li>
              2）结算服务。平台为用户之间的娱乐服务费用结算提供服务。服务结束后服务使用方应当按照NN约玩的收费标准支付平台服务费用。
            </li>
            <li>3）评价服务。用户可能通过平台对娱乐服务作出评价或提出意见。</li>
          </ol>
        </li>
        <li>
          2、本公司可以对提供的具体服务内容予以变更，且本公司提供的服务内容可能随时变更。具体详情以访问NN约玩时提供的服务项目为准。
        </li>
        <li>
          3、在本协议履行过程中，本公司可根据情况对本协议进行修订。本公司将通过NN约玩公布修订后的服务协议，不再向用户作个别通知。如果用户不同意NN约玩对本协议所做的修订，用户有权停止使用本服务。如果用户继续接受本服务，则视为用户接受NN约玩对本协议所做的修订，并应按修订后的协议履行。
        </li>
      </ol>
      <h2>四、用户</h2>
      <ol>
        <li>
          1、NN约玩的用户指通过电子邮箱或手机号在NN约玩进行个人信息注册，同意接受本公司依据本协议所提供的服务、符合中华人民共和国法律规定的具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人。18岁以下的未成年人注册和接受本服务应事先取得监护人的同意。
        </li>
        <li>
          2、用户承诺以下事项：
          <ol>
            <li>1) 用户必须提供真实、最新、有效及完整的个人信息资料。</li>
            <li>
              2)
              用户有义务维持并更新注册的个人信息资料，确保其所提供的个人信息资料真实、最新、有效及完整。若用户提供任何错误、虚假、过时或不完整的个人信息资料，或者依NN约玩的独立判断怀疑该个人信息资料为错误、虚假、过时或不完整，NN约玩有权暂停或终止用户的账号，并拒绝用户使用NN约玩部分或全部功能。在此情况下，NN约玩不承担任何责任，并且用户同意承担NN约玩因此所产生的直接或间接的支出，以及赔偿NN约玩因此所遭受的直接或间接的损失。
            </li>
            <li>
              3)
              如因用户未及时更新个人信息资料，导致本服务无法提供或提供时发生任何错误，用户不得将此作为取消交易或拒绝付款的理由，本公司亦不承担任何责任，所有后果应由用户自行承担。
            </li>
          </ol>
        </li>
      </ol>
      <h2>五、隐私权政策</h2>
      <ol>
        <li>
          1、用户在注册账号或接受NN约玩服务的过程中，需要提交必要的信息（包括用户的个人隐私信息和非个人隐私信息）。如用户提交的信息不完整或不符合法律法规的规定，则用户可能无法接受本服务或在接受服务的过程中受到限制。
        </li>
        <li>
          2、用户的个人隐私信息是指涉及用户个人身份或个人隐私的信息，包括但不限于用户真实姓名、身份证号码、手机号码、手机设备识别码、IP地址、用户聊天记录等。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在NN约玩的基本记录信息、个人隐私信息范围外的其他普通信息、用户同意公开的上述隐私信息。
        </li>
        <li>
          3、本公司将采取技术措施或其他必要措施，确保用户个人隐私信息安全，防止在本服务中收集的用户个人隐私信息泄露、毁损或丢失。在可能发生前述情形的时，将及时采取补救措施。
        </li>
        <li>
          4、本公司及NN约玩未经用户同意不向任何第三方公开、透露用户个人隐私信息。但以下特定情形除外：
          <ol>
            <li>
              1) 本公司根据法律法规规定或有权机关的要求提供用户的个人隐私信息；
            </li>
            <li>
              2)
              由于用户将其账号密码告知他人或与他人共享注册账号与密码，由此导致的任何个人信息的泄露，或其他非因本公司原因导致的个人隐私信息的泄露；
            </li>
            <li>3) 用户自行向第三方公开其个人隐私信息；</li>
            <li>
              4)
              用户与本公司及合作单位之间就用户个人隐私信息的使用公开达成约定，本公司基于该约定而向合作单位披露用户的个人隐私信息；
            </li>
            <li>
              5)
              任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露。
            </li>
          </ol>
        </li>
        <li>
          5、用户同意本公司可在以下事项中使用用户的个人隐私信息：
          <ol>
            <li>
              1) 本公司向用户及时发送重要通知，如软件更新，本协议条款的变更；
            </li>
            <li>
              2)
              本公司内部进行审计、数据分析和研究等，以改进本公司的产品或服务，以及改进本公司与用户之间的沟通；
            </li>
            <li>3) 本公司审核用户信息及进行处理措施；</li>
            <li>4) 法律法规规定的其他事项。</li>
          </ol>
        </li>
        <li>
          6、用户确认，其地理位置信息为非个人隐私信息，用户成功注册NN约玩账号视为确认授权本公司提取、公开及使用用户的地理位置信息。用户地理位置信息将作为用户公开资料之一，由本公司向其他用户公开。如用户需终止向其他用户公开其地理位置信息，可随时自行设置。
        </li>
        <li>
          7、用户确认，其消费信息、收益获得信息为非个人隐私信息，用户成功注册NN约玩账号视为确认授权本公司提取、公开及使用用户的消费信息、收益获得信息。用户消费信息、收益获得信息将作为用户公开资料之一，由本公司向其他用户公开。
        </li>
        <li>
          8、为了改善本公司的技术和服务，向用户提供更好的服务体验，本公司或会自行收集使用或向第三方提供用户的非个人隐私信息。
        </li>
      </ol>
      <h2>六、内容规范及使用规则</h2>
      <ol>
        <li>
          1、用户通过NN约玩所传送、发布的任何内容并不反映或代表、也不得被视为反映或代表本公司的观点、立场或政策，本公司对此不承担任何责任。
        </li>
        <li>
          2、用户不得利用NN约玩账号制作、上传、发布、传播如下法律、法规和政策禁止的内容：
          <ol>
            <li>1) 反对宪法所确定的基本原则的；</li>
            <li>
              2) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
            </li>
            <li>3) 损害国家荣誉和利益的；</li>
            <li>4) 煽动民族仇恨、民族歧视，破坏民族团结的；</li>
            <li>5) 破坏国家宗教政策，宣扬邪教和封建迷信的；</li>
            <li>6) 散布谣言，扰乱社会秩序，破坏社会稳定的；</li>
            <li>
              7) 散布淫秽、色情、赌博、暴力、凶杀、恐怖内容或者教唆犯罪的；
            </li>
            <li>8) 侮辱或者诽谤他人，侵害他人合法权益的；</li>
            <li>9) 含有法律、行政法规禁止的其他内容的信息。</li>
          </ol>
        </li>
        <li>
          3、用户不得利用NN约玩账号制作、上传、发布、传播如下干扰NN约玩正常运营，以及侵犯其他用户或第三方合作权益的内容：
          <ol>
            <li>1) 含有任何性暗示的；</li>
            <li>2) 含有辱骂、恐吓、威胁内容的；</li>
            <li>3) 含有骚扰、垃圾广告、恶意信息、引诱或欺骗性信息的；</li>
            <li>4) 涉及他人隐私、个人信息或资料的；</li>
            <li>5) 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权益的；</li>
            <li>
              6)
              含有其他干扰NN约玩正常运营和侵犯其他用户或第三方合法权益内容的信息。
            </li>
          </ol>
        </li>
        <li>
          3、用户不得利用NN约玩进行如下行为：
          <ol>
            <li>1)发布虚假信息或盗用他人头像或资料，冒充他人名义；</li>
            <li>2) 强制、诱导其他用户关注、点击链接页面或分享信息；</li>
            <li>3) 虚构事实、隐瞒真相以误导、欺骗他人；</li>
            <li>4) 利用技术手段批量建立虚假账号；</li>
            <li>5) 利用NN约玩账号从事任何犯罪活动；</li>
            <li>
              6)
              制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播；
            </li>
            <li>
              7)
              其他违反法律法规、侵犯其他用户合法权益、干扰NN约玩正常运营或本公司未明示授权的行为。
            </li>
          </ol>
        </li>
        <li>
          4、用户须对利用NN约玩账号传送信息的真实性、合法性、准确性、有效性等负责，并保证该信息不得违反公序良俗。与用户所传播信息相关的任何法律责任由用户自行承担，与本公司和NN约玩无关。如因此给本公司或第三方造成损害的，用户应当依法予以赔偿。
        </li>
        <li>
          5、用户在NN约玩的内容消费（内容消费特指：聊天室礼物打赏、动态礼物打赏、消息礼物打赏、属于礼物打赏等）行为，皆完全基于您的自主、自愿行为；内容消费行为一旦发生概不退款；由用户自行对内容消费负责；本公司不承担任何责任。
        </li>
        <li>
          6、本公司提供的服务中可能包括广告，用户同意在使用过程中显示本公司和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对基于该广告信息而进行的交易负责。对用户因依该广告信息进行的交易或前述广告商提供的内容或遭受的损失或损害，本公司及NN约玩不承担任何责任。
        </li>
        <li>
          7、用户在NN约玩产生的收入（如有）应自行向税务机关依法纳税，因用户偷税漏税相关的任何法律责任由用户自行承担，与本公司和NN约玩无关。如因此给本公司或第三方造成损害的，用户应当依法予以赔偿。
        </li>
      </ol>
      <h2>七、虚拟货币及支付</h2>
      <ol>
        <li>
          1、本公司在NN约玩平台发行虚拟货币，即N币。用户确认，购买的N币只能用于本产品提供的线上订单支付服务。任何情况下不得向本公司以外的第三方进行购买。如违反前述约定，造成用户或第三方任何损失，本公司不负任何责任，且本公司有理由怀疑用户的账号或使用情况有作弊或异常状况，本公司将拒绝该用户使用账号内N币进行支付，直至按本协议约定采取相关封禁措施。
        </li>
        <li>
          2、定价权:本公司享有对NN约玩上一切服务和商品的定价权。用户应遵守NN约玩的定价规则，不得擅自对NN约玩的定价规则进行任何形式的更改。用户不得以任何形式绕开NN约玩内定价规则进行线上或线下交易，亦不得通过私下交易的方式逃避NN约玩的定价规则。
        </li>
      </ol>
      <h2>八、账号管理</h2>
      <ol>
        <li>
          1、NN约玩账号的所有权归本公司所有，用户完成申请注册手续后，获得NN约玩账号的使用权。该使用权仅属于初始申请注册人，未经本公司允许，禁止赠予、共用、租赁、转让。本公司因经营需要，有权回收用户的账号。
        </li>
        <li>
          2、用户可以更改、删除NN约玩账号上的个人资料、注册信息及传送内容等。但需注意，删除有关信息的同时也会删除用户储存在系统中的文字和图片，用户需自行承担相应后果和风险。
        </li>
        <li>
          3、用户有责任妥善保管注册账号信息，并自行负责账号密码的安全。因用户保管不善而遭受的盗号或密码失窃及相应损失由用户自行承担。用户需要对注册账号以及密码下的行为承担法律责任。用户同意在任何情况下不使用其他用户的账号或密码。在用户怀疑他人使用其账号或密码时，用户应立即通知本公司。
        </li>
        <li>
          4、用户应遵守本协议的各项条款，正确、适当地使用本服务，如因用户违反本协议中的任何条款，本公司在通知用户后有权依据协议中断或终止对违约用户的账号提供服务。同时，本公司保留在任何时候收回账号的权利。
        </li>
        <li>
          5、如用户注册账号后连续24个月不登陆，本公司在不通知用户的情况下可以收回该账号，以免造成资源浪费，由此造成的不利后果（含账号内虚拟财产的灭失等）由用户自行承担。
        </li>
      </ol>
      <h2>九、数据储存</h2>
      <ol>
        <li>
          1、本公司及NN约玩不对用户在本服务中相关数据的删除或储存失败负责。
        </li>
        <li>
          2、本公司可以根据实际情况自行决定用户在本服务中数据的最长储存期限，并在服务器上为其分配数据最大的存储空间等。用户根据自己的需要自行备份本服务中的相关数据。
        </li>
        <li>
          3、如用户停止使用本服务或本服务终止，本公司可以从服务器上永久删除用户的数据。本服务停止或终止后，本公司没有义务向用户返还任何数据。
        </li>
      </ol>
      <h2>十、风险承担</h2>
      <ol>
        <li>
          1、用户理解并同意，NN约玩仅为用户提供信息分享、传送及获取的平台，用户必须为自己注册账号下的一切行为负责，包括用户所传送的任何内容以及由此产生的任何后果。用户应对NN约玩及本服务中的内容自行加以判断，并承担因使用前述内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。本公司及NN约玩无法且不会对因用户行为而导致的任何损失或损害承担责任。如果用户发现任何人违反本协议约定或以其他不当的方式使用本服务，请立即向本公司举报或投诉，本公司将依本协议约定进行处理。
        </li>
        <li>
          2、用户理解并同意，因业务发展需要，本公司保留单方面对本服务的全部或部分服务内容变更、暂停、终止或撤销的权利，用户需承担此风险。
        </li>
      </ol>
      <h2>十一、知识产权声明</h2>
      <ol>
        <li>
          1、除本服务中涉及广告的知识产权由相应广告商享有外，本公司在本服务中提供的内容（包括但不限于网页、文字、图片、音频、视频、图表等）的知识产权均归本公司所有，但用户在使用本服务前对自己发布的内容已合法取得知识产权的除外。
        </li>
        <li>
          2、除另有特别声明外，本公司提供本服务时所依托软件的著作权、专利权及其他知识产权均归本公司所有。
        </li>
        <li>
          3、本公司在本服务中所涉及的图形、文字或其组成，以及其他本公司标志及产品、服务名称（以下统称“本公司标识”），其著作权或商标权归本公司所有。未经本公司事先书面同意，用户不得将本公司标识以任何方式展示或使用或作其他处理，也不得向他人表明用户有权展示、使用或其他有权处理本公司标识的行为。
        </li>
        <li>
          4、上述及其他任何与本公司或相关广告商依法拥有的知识产权均受到法律保护，未经本公司或相关广告商书面许可，用户不得以任何形式进行使用或创造相关衍生作品。
        </li>
      </ol>
      <h2>十二、法律责任</h2>
      <ol>
        <li>
          1、如果本公司发现或收到他人举报或投诉用户违反本协议的约定的，本公司有权不经通知随时对相关内容，包括但不限于用户资料、聊天记录进行审查、删除，并视情节轻重对违规账号处以包括但不限于警告、功能封禁、账号冻结、设备封禁、永久封号的违规违约处理。
        </li>
        <li>
          2、用户理解并同意，本公司有权依合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规的任何用户采取适当的法律行动，并依据法律法规保存有关信息、向有关部门报告等，用户应承担由此产生的一切法律责任。
        </li>
        <li>
          3、用户理解并同意，因用户违反本协议约定，导致或产生的任何第三方主张的任何索赔、要求或损失（包括合理的律师费），用户应当向本公司与合作公司、关联公司赔偿。
        </li>
        <li>
          4、用户理解并同意，因用户违反本协议约定，导致本公司对其进行永久封号处理的，用户被永久封号后，账号内的现金余额将不得再进行提现。上述现金余额将视为违规用户向本公司支付的违约金，由本公司收取并支配。
        </li>
      </ol>
      <h2>十三、不可抗力及其他免责事由</h2>
      <ol>
        <li>
          1、用户理解并确认，在接受本服务的过程中，可能会遇到不可抗力等风险因素，使本服务中断。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等以及社会事件如战争、动乱、政府行动等。出现上述情况时。本公司将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，本公司及合作单位在法律允许的范围内免责。
        </li>
        <li>
          2、本服务同大多数互联网服务一样，受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰，如他人利用用户的资料，造成现实生活中的骚扰；用户下载安装的其它软件或访问的其他网站中含有“木马病毒等，威胁到用户的计算机信息和数据的安全，继而影响本服务的正常使用等等。用户应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰。
        </li>
        <li>
          3、用户理解并确认，本服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置、用户关机以及其他任何技术、互联网络、通信线路原因等造成的服务中断或不能满足用户要求的风险，因此导致的用户或第三方任何损失，本公司不承担任何责任。
        </li>
        <li>
          4、用户理解并确认，在使用本服务过程中存在来自任何他人的包括误导性的、欺骗性的、威胁性的、诽谤性的、令人反感的或非法的信息，或侵犯他人权利的匿名或冒名的信息，以及伴随该等信息的行为，因此导致的用户或第三方的任何损失，本公司不承担任何责任。
        </li>
        <li>
          5、用户理解并确认，本公司需要定期或不定期地对NN约玩平台或相关的设备进行检修或者维护，如因此类情况而造成服务在合理时间内的中断，本公司无需为此承担任何责任。
        </li>
        <li>
          6、本公司依据法律法规、本协议约定获得处理违法违规或违约内容的权利，该权利不构成本公司的义务或承诺，本公司不能保证及时发现违法违规或违约行为或进行相应处理。用户如若发现有有违法违规行为的，应当及时通知本公司，以便本公司采取适当措施。
        </li>
        <li>
          7、用户理解并确认，在任何情况下，本公司均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因用户使用本服务而遭受的利润损失，承担责任（即使本公司已被告知该等损失的可能性亦然）。本公司对用户承担的全部责任，无论因何原因或何种行为方式，始终不超过用户因使用本公司提供的服务而支付给本公司的费用(如有)。
        </li>
      </ol>
      <h2>十四、服务的变更、中断、终止</h2>
      <ol>
        <li>
          1、鉴于网络服务的特殊性，用户同意本公司有权随时变更、中断或终止部分或全部的服务（包括收费服务）。
        </li>
        <li>
          2、如发生下列任何一种情形，本公司有权变更、中断或终止向用户提供的免费服务或收费服务，而无需对用户或任何第三方承担任何责任：
          <ol>
            <li>
              1)
              根据法律规定用户应提交真实信息，而用户提供的个人资料不真实或与注册时信息不一致又未能提供合理证明；
            </li>
            <li>2) 用户违反相关法律法规或本协议的约定；</li>
            <li>3) 按照法律规定或有权机关的要求；</li>
            <li>4) 出于安全的原因或其他必要的情形。</li>
          </ol>
        </li>
      </ol>
      <h1>十五、用户权益保障</h1>
      <ol>
        <li>
          1、用户权益保障承诺
          <br />本公司一直秉承“客户第一”的原则。为保障用户在使用服务时的合法权益，本公司承诺会守法经营、公平竞争、接受社会监督。
        </li>
        <li>
          2、用户资金保障
          <br />本公司始终重视保护用户的资金安全，将自有资金和用户资金分开存放，承诺不挪用、占用用户资金。
        </li>
        <li>
          3、用户信息保障
          <br />本公司重视对用户信息的保护，将严格遵守本协议关于用户个人隐私信息保护的约定。
        </li>
      </ol>
      <h2>十六、特别声明</h2>
      <p>
        本公司在此依法做出特别声明如下：
        本公司采取合理的方式提请用户注意的义务将通过如下方式实现：在本协议中本公司以明确的足以引起用户注意的加粗字体、下划线等合理方式提醒用户注意相关条款（需要强调的是，还包括用户应特别注意任何未明确标记的含有“不承担”、“免责”、“不得”等形式用语的条款），该等条款的确认将导致用户在特定情况下的被动、不便、损失，请用户在确认同意本协议之前再次阅读上述条款。双方确认上述条款不属于《合同法》第40条规定的“免除其责任、加重对方责任、排除对方主要权利的”条款。
        用户如有任何需要说明条款的要求，请立即停止使用服务，同时立即发送邮件至【yuewan@nn.com】
        ，若用户未发送有说明条款要求的邮件至本公司而选择同意该协议，则双方在此确认本公司已依法履行了根据用户要求对相关条款进行说明的法定义务，本公司已给予用户充足的时间与充分的选择权来决定是否缔结本协议。
        鉴于本公司已依法明确了上述条款、履行了格式条款制订方的义务，用户点击同意或下一步，将被视为且应当被视为用户已经完全注意并同意了本协议所有条款，用户不应当以本公司未对格式条款以合理方式提醒用户注意或未根据用户要求尽到说明义务为理由而声称或要求法院或其它任何第三方确认相关条款非法或无效。
      </p>
      <h2>十七、法律适用与管辖</h2>
      <p>
        本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并由本公司住所地人民法院管辖。
      </p>
    </md-landscape>
  </div>
</template>
<script>
import { Icon, InputItem, Button, Landscape } from "mand-mobile";
import { mapState, mapActions } from "vuex";
import axios from "axios";
import { wx_authorize, wxConfig } from "@/utils";

export default {
  name: "sign-up",
  components: {
    [Icon.name]: Icon,
    [InputItem.name]: InputItem,
    [Button.name]: Button,
    [Landscape.name]: Landscape
  },
  data() {
    return {
      sendCode: {
        status: false,
        time: 60
      },
      protocol: false,
      signUp: {
        phone: "",
        password: "",
        code: process.env.VUE_APP_PLATFORM,
        invite: ""
      },
      passwordStatus: false
    };
  },
  computed: {
    ...mapState("global", ["areaCode"])
  },
  methods: {
    login() {
      this.$http.login().then(res => {
        console.log("loginRes", res);
        axios
          .get(`http://qq156471181.vicp.cc/wx/getWxConfig?url=${location.href}`)
          .then(res => res.data)
          .then(({ rtnInfo: { data } }) => {
            const { appId, noncestr, signature, timestamp } = data;

            wxConfig({
              appId,
              nonceStr: noncestr,
              signature,
              timestamp
            });
          });
      });
    },
    authorizeWx() {
      wx_authorize();
    },
    gotoBasicInfo() {
      this.$router.push({ name: "basic_info" });
    },
    ...mapActions("global", ["toggleAreaSelector"])
  },
  mounted() {
    console.log("PLATFORM", process.env.VUE_APP_PLATFORM);
  }
};
</script>
<style lang="stylus" scoped>
#sign_up {
  padding: 32px 0;
}
</style>
